// პრობლემის ფორმალური სახე ასეთია:
// ჩვენ გვჭირდება მოვახდინოთ მიღებული ტექსტური მასივის ელემენტების შედარება სამი ტიპის კოლექციასთან
// უფრო კონკრეტულად, გადმოცემული ტექსტის პირველი წევრი განსაზღვრავს თუ რომელ კოლექციასთან მოხდება მომდევნო წევრების შედარება
// გამომდინარე პირობიდან, რადგან თუ მიღებული ტექსტის ყველა წევრი არ იყრის თავს ერთ კოლექციაში
// მაშინ ესეთი ტექსტი არა ვალიდურია.

// უნდა გავითვალისწინოთ რომ გადმოცემული ტექსტის წევრები შეიძლება შეიცავდნენ როგორც მაღალ ასევე დაბალ სიმბოლოებს
// შედარების თვალსაზრისით, მაღალი და დაბალი სიმბოლოები განსხვავებული მნიშვნელობებია, თუმცა 
// მოცემული დავალებისთვის მათი მნიშვნელობა იდენტურია
