// ამოცანის მიზანია ვიპოვოთ უწყვეტი და თან ზრდადი უდიდესი ქვემმიმდევრობა
// პასუხის დასაბრუნებლად საკმარისია ვიპოვოთ საწყისი და საბოლოო ინდექსები
// ვფიქრობ მიზნის მისაღწევად საკმარისია ერთი იტერაცია შემნახველი ცვლადებით

// თითოეული ელემენტი უნდა შედარდეს მომდევნოს
// თუ ამჟამინდელი მიმთითებლის მინშვნელობები "ნულ"ია მაშინ ამჟამინდელი ინდექსი გახდება მიმთითებელი
// თუ მომდევნო ელემენტის მნიშვნელობა მეტია ამჟამინდელზე, მაშინ მომდევნო ელემენტის ინდექსი შედის ვალიდურ მიმდევრობაში
// თუ მიმდევრობა შეწყდება, ანუ მომდევნო ელემენტის მნიშვნელობა არ არის ამჟამინდელზე მეტი
// მაშინ ამჟამინდელი ელემენტის ინდექსი იქნება მიმდევრობის ბოლო წევრი
// თუ მიმდევრობა შეწყდა ამჟამინდელ სიგრძეს ვადარებთ წინა დამახსოვრებულ სიგრძესთან, თუ ასეთი არსებობს, და ვინახავთ უფრო გრძელს
// როდესაც მიმდევრობა შეწყდება ვა"ნულ"ებთ მიმდევრობის საზღვების მიმთითებლებს
