// რადგან ტკბილეულის რაოდენობა n ყოველთვის ლუწია
// ელისი შეჭამს n/2 რაოდენობის ტკბილეულს
// მისი მიზანია რომ ამ რაოდენობაში მოექცეს რაც შეიძლება მეტი სახეობა ტკბილეულის
// ჩვენი მიზანია დავითვალოთ რამდენი სახეობის ტკბილეული აქვს ელისს
// თუ სახეობების რაოდენობა მთლიანი რაოდენობის ნახევარზე მეტია
// მაშინ ელისს შეუძლია ყოველი შეჭმული ტკბილეული განსხვავებული აირჩიოს
// თუ ნაკლებია მაშინ ტკბილეულის სახეობათა რაოდენობა იქნება იმ განსხვავებულ სახეობათა 
// რაოდენობა რაც ელისს შეუძლია რომ შეჭამოს