// ამოცანის მიზანია ისეთი სამი ელემენტის შერჩევა მასივიდან რომელთა ნამრავლი იქნება უდიდესი, ყველა შესაძლო ნამრავლთა შორის
// სიტუაციას ართულებს ელემენტთა შესაძლო უარყოფითობა, წინააღმდეგ შემთხვევაში სასურველი შედეგის მისაღებად საკმარისი იქნებოდა სამი უდიდესი მნიშვნელობის მქონე ელემენტის პოვნა
// თუმცა მოცემულ სიტუაციაში უნდა გავითვალისწინოთ, რომ თუ შევარჩევთ ორ ისეთ ელემენტს რომელიც წარმოდგენილია მინუსის ნიშნით, თუმცა მათი აბსოლიტური მნიშვნელობები
// აღემატება დადებითი ნიშნით წარმოდგენილ ელემენტთა აბსოლიტურ მნიშვნელობებს
// მაშინ მინუს ნიშნიანი ელემენტების ნამრავლი იქნება უფრო მეტი.

// შეზღუდვების უკეთ გასაანალიზებლად, შევეცდები შესაძლო კომბინაციების ჩამოთვლას

// ყველა ელემენტი არის მინუს ნიშნით, ამ შემთხვევაში გარდაუვალია ნამრავლის მინუს ნიშანი, შესაბამისად უნდა ვეცადოთ ისეთი ელემენტების შერჩევა, რომელთა აბსოლიტური მნიშვნელობები უმცირესია, რათა მივიღოთ უდიდესი ნამრავლი
// ყველა ელემენტი, გარდა ერთისა, არის მინუს ნიშნით, ამ შემთხვევაში სიტუაცია რადიკალურად იცვლება, ჩვენ გვჭირდება ორი უდიდესი აბსოლიტური მნიშვნელობის მქონე ელემენტი რომელთა ნამრავლას გავამრავლებთ ერთადერთ დადებით ნიშნიან ელემენტზე, რაც მოქგვცემს ნამრავლის მაქსიმალურ მნიშვნელობას
// ყველა ელემენტი დადებითია, გარდა ერთისა, ამ შემთხვევაში ვეძებთ უდიდეს მნიშვნელობის დადებით ელემენტებს, რადგან კენტი რაოდენობის მინუსის ნიშნიანი ელემენტები ჩვენთვის გამოუსადეგარია, რაგინდ დიდი არ იყოს მისი აბსოლიტური მნიშვნელობა
// მასივის ელემენტები შერეულია დადებითი და უარყოფითი მნიშვნელობებით, ამ შემთხვევაში უნდა განვიხილოთ მინუს ნიშნით წარმოდგენილ ელემენტებს შორის აბსოლიტური მნიშვნელობით უდიდესი ორი ელემენტის ნამრავლი თუ უფრო მეტია ვიდრე დადებითი ნიშნით წარმოდგენილ უდიდეს ელემენტებს შორის მეორე და მესამე პოზიციებზე მდომი ელემენტების ნამრავლი, მაშინ უდიდეს საბოლოო ნამრავლს მოგვცემს ორი უმცირესი უარყოფითი ელემენტისა და ერთი უდიდესი დადებითი ელემენტის ნამრავლი
// თუ ყველა ელემენტი დადებითია, მაშინ საბოლოო ნამრავლი უდიდესი სამი ელემენტის ნამრავლის ტოლი იქნება

// მოცემულ შესაძლო ვარიაციებზე დაკვირვებით შეიძლება დავასკვნათ, რომ გადაწყვეტილების მისაღებად საკმარისია ვიპოვოთ სამი უმცირესი და სამი უდიდესი მნიშვნელობა მოცემულ მნიშვნელობებს შორის