// პირველ რიგში შევნიშნოთ, რომ თუ გადმოცემული მატრიცა და გადმოცემული პარამეტრები არათავსებადია
// ვაბრუნებთ გადმოცემულ მატრიცას შეუცვლელად
// სხვა შემთხვევაში მიღებული პარამეტრებით ვქმნით ორ განზომილებიან მასივს და ვწურავთ მასში გადმოცემულ მატრიცას

// ჩაწურვის ორი მეთოდი მაფიქრდება
// პირველი მასივზე იტერაციით, ციკლები შევქმნათ უშუალოდ მასივების ზომების შესაბამისად
// მეორე ელემენტების საერთო რაოდენობისა და მიმართული ცვლადების გამოყენებით
// რადგან ელემენტების სრული რაოდენობა ცნობილია, შესაძლებელი უნდა იყოს ამ რაოდენობის იტერაციით
// სასურველი შედეგის მიღება

// ალგორითმი:
// ნაბიჯი 1 - თუ გადმოცემული მატრიცა და გადმოცემული პარამეტრები არათავსებადია, მაშინ დავაბრუნოთ გადმოცემული მატრიცა
// ნაბიჯი 2 - შევქმნათ ორ განზომილებიანი მასივი answer მიღებული პარამეტრების შესაბამისად
// ნაბიჯი 3 - შევქმნათ ცვლადები origCol, origRow, newCol და newRow და მივცეთ მათ მნიშვნელობა 0
// ნაბიჯი 4 - შევქმნათ ციკლი ელემენტთა საერთო რაოდენობის შესაბამისად
// ნაბიჯი 5 - სანამ [origCol][origRow] ვალიდური ელემენტია და [newCol][newRow] ცარიელი ადგილი
// ნაბიჯი 6 - ჩავწეროთ [newCol][newRow] ზე [origCol][origRow]
// ნაბიჯი 7 - მიმართული ცვლადები ვაკონტროლოთ და განვააახლოთ თ გახდება არავალიდური
// ნაბიჯი 8 - დავაბრუნოთ answer როგორც ფუნქციის შედეგი