// პირველ რიგში შევნიშნოთ, რომ თუ გადმოცემული მატრიცისა და გადმოცემული პარამეტრები არათავსებადია
// ვაბრუნებთ გადმოცემულ მატრიცას შეუცვლელად
// სხვა შემთხვევაში მიღებული პარამეტრებით ვქმნით ორ განზომილებიან მასივს და ვწურავთ მასში გადმოცემულ მატრიცას

// ჩაწურვის ორი მეთოდი მაფიქრდება
// პირველი მასივზე იტერაციით, ციკლები შევქმნათ უშუალოდ მასივების ზომების შესაბამისად
// მეორე ელემენტების საერთო რაოდენობისა და მიმაართული ცვლადების გამოყენებით
// რადგან ელემენტების სრული რაოდენობა ცნობილია, შესაძლებელი უნდა იყოს ამ რაოდენობის იტერაციით
// სასურველი შედეგის მიღება