// ამოცანის მიზანია დავაზუსტოთ მასივის უკანასკნელი ნოლი არის წარმოდგენილი როგორც ნოლი თუ ის 10 ის შემადგენელი ნაწილია
// მასივის ელემენტთა რაოდენობის კენტობა ლუწობა ამის გადასაწყვეტად არ გამოგვადგება რადგან 0 ვალიდური წევრია და შეიძლება მასივის შუაშიც გვხვდებოდეს
// უნდა გავყვეთ თითოეულ წევრს და მოვახდინოთ მათი იდენტიფიცირება
// თუმცა ეს პროცესი უმჯობესია დავიწყოთ ბოლოდან და ვიგულისხმოთ რომ 0 დამოუკიდებელი წევრია
// თუ ვერ შევძლებთ ამ მიდგომით მასივის საწყის ელემენტზე გასვლას, გამოვა რომ ის არ არის დამოუკიდებელი წევრი
