// ამოცანის მიზანია დავაზუსტოთ მასივის უკანასკნელი ნოლი არის წარმოდგენილი როგორც ნოლი თუ ის 10 ის შემადგენელი ნაწილია
// მასივის ელემენტთა რაოდენობის კენტობა ლუწობა ამის გადასაწყვეტად არ გამოგვადგება რადგან 0 ვალიდური წევრია და შეიძლება მასივის შუაშიც გვხვდებოდეს
// უნდა გავყვეთ თითოეულ წევრს და მოვახდინოთ მათი იდენტიფიცირება
// თუმცა ეს პროცესი უმჯობესია დავიწყოთ ბოლოდან და ვიგულისხმოთ რომ 0 დამოუკიდებელი წევრია
// თუ ვერ შევძლებთ ამ მიდგომით მასივის საწყის ელემენტზე გასვლას, გამოვა რომ ის არ არის დამოუკიდებელი წევრი

// ალგორითმი
// ნაბიჯი 1 - შევქმნათ ციკლი მასივის ელემენტების გამოსაძახებლად
// ნაბიჯი 2 - თუ ამჟამინდელი წევრი არის 1 მაშინ ის ორობითი ელემენტის ნაწილია და ვინაცვლებთ წინ 2 ბიჯით
// ნაბიჯი 3 - თუ ამჟამინდელი წევრი არის 0 მაშინ ის ცალკეული წევრია და ვამოწმებთ შემდეგ წევრს
// ნაბიჯი 4 - თუ ბოლო წევრი ცალკეულია ვაბრუნებთ true სხვა შემთხვევაში false

function isOneBitCharacter(bits: number[]): boolean {
    for(let i=0; i<bits.length; ){
        if(i=== bits.length-1) return true
        if(bits[i] === 1) i+=2
        else if(bits[i] === 0) i++
    }
    return false
};