// ორობითი ძებნის ალგორითმი "დაყავი და დაიპყარი" ტიპის ალგორითმების კატეგორიაში გვხვდება
// მის განსახორციელებლად აუცილებელი მოთხოვნაა რომ მიღებული მონაცემები უნდა იყოს დალაგებული
// ალგორითმის პრინციპი შემდეგია: მიღებული სიიდან ვირჩევთ შუა პოზიციაზე მდგომ ელემენტს
// თუ ეს ელემენტი ჩვენი ძებნის მიზანი არ არის მაშინ განვსაზღვრავთ უნდა გავაგრძელოთ ძებნა მასე მნიშვნელობით მეტი თუ ნაკლები ელემენტების სიმრავლეში
// ამ გადაწყვეტილების მისაღებად აუცილებელია ზემოთ ხსენებული პირობა რომ სია იყოს დალაგებული
// შესაბამისად ალგორითმი ყოველი გადაწყვეტილების მიღების მომენტში, თუ ეს წარუმატებელი მცდელობაა
// შემდგომი ძიებისთვის საძიებო ელემენტთა სიმრავლეს ანახევრებს
// შესაბამისად ალგორითმის კომპლექსურობა გამოისახება ფორმულით O(log n)