// ამოცანის მიზანია თითოეული უჯრისთვის დავითვალოთ საშუალო
// პირდაპირი გადაჭრა იქნება ისეთი ფუნქციიეს შექმნა რომელშიც მოვიძევთ ყველა მეზობელს და დავივლით საშუალოს
// შემდეგ კი ყოველი უჯირსთვის გავუშვებთ ხსენებულ ფუნქციას

// უჯრა შეიძლება იყოს კუთხის, გვერდის ან ცენრალური
// შესაბამისად გვაქვს სამი შემთხვევა გასათვალისწინებელი
// ასევე საყურადღებოა ის ფაქტიც რომ მეზობელი უჯრა შეიძლება იყოს ცარიელი
// თუ მეზობელი ცარიელი უჯრაა მას არ ვითვალისწინებთ საშუალოს დათვლისას

// ალგორითმი საშუალოს მთვლელი
// ნაბიჯი 1 - თუ მოცემული უჯრა კუთხისაა მაშინ ავჯამოთ 2x2 მატრიცა მის გარშემო და გავყოთ 4-ზე
// ნაბიჯი 2 - თუ მოცემული უჯრა კედლისაა მაშინ ავჯამოთ 2x3 მატრიცა და გავყოთ 6-ზე
// ნაბიჯი 3 - ავჯამოთ 3x3 მატრიცა მოცემული უჯრის გარშემო და გავყოთ 9-ზე

// ძირითადი ალგორითმი 
// ნაბიჯი 1 - შევქმნათ ცარიელი მასივი smoother რომელშიც შევინახავთ გარდაქმნილ მასივს
// ნაბიჯი 2 - შევქმნათ ციკლი გადმოცემული მატრიცის ყოველი ელემენტის გამოსაძახებლად
// ნაბიჯი 3 - თითოეული ელემენტისთვის გამოვიძახოთ საშუალოს მთვლელი და მიღებული შედეგი ჩავსვათ შესაბამის პოზიციაზე smoother მასივში