// ჩვენი ამოცანაა გადმოცემული მასივი გარდავქმნათ ისეთ წყვილებად
// რომ თუ წყვილებს შორის მინიმალურ მნიშვნელობებს დავაჯამებთ
// ჯამი იყოს მაქსიმალური

// სხვა სიტყვებით რომ ვთქვათ წყვილის მინიმალური მნიშვნელობის მაქსიმიზაციას ვცდილობთ
// ინტუიციურად, წყვილებს შორის უნდა იყოს მინიმალური სხვაობა
// შესაბამისად შეგვიძლია ყოველი ელემენტისთვის მოვძებნოთ მასთან მნიშვნელობით ყველაზე ახლოს მდგომი ელემენტი
// და მიღებული წყვილი გამოვრიცხოთ შემდგომი დაწყვილების პროცესში

// ასევე ინტუიციურად ვფიქრობ რომ თუ მასივი დალაგებულია მაშინ ოპტიმალურია ყოველი მომდევნო წყვილი

// ალგორითმი:

// ნაბიჯი 1 - დავალაგოთ გადმოცემული მასივი
// ნაბიჯი 2 - შევქმნათ ცარიელი მასივი წყვილების შესანახად
// ნაბიჯი 3 - დალაგებული მასივის ყოველი მომდევნო ელემენტი დავაწყვილოთ და გადავცეთ წყვილების მასივს
// ნაბიჯი 4 - წყვილების მასივის ყოველი წყვილის მინიმალური მნიშვნელობა ავჯამოთ და დავაბრუნოთ როგორც ფუნქციის შედეგი
