// ჩვენი ამოცანაა გადმოცემული მასივი გარდავქმნათ ისეთ წყვილებად
// რომ თუ წყვილებს შორის მინიმალურ მნიშვნელობებს დავაჯამებთ
// ჯამი იყოს მაქსიმალური

// სხვა სიტყვებით რომ ვთქვათ წყვილის მინიმალური მნიშვნელობის მაქსიმიზაციას ვცდილობთ
// ინტუიციურად, წყვილებს შორის უნდა იყოს მინიმალური სხვაობა
// შესაბამისად შეგვიძლია ყოველი ელემენტისთვის მოვძებნოთ მასთან მნიშვნელობით ყველაზე ახლოს მდგომი ელემენტი
// და მიღებული წყვილი გამოვრიცხოთ შემდგომი დაწყვილების პროცესში

// ასევე ინტუიციურად ვფიქრობ რომ თუ მასივი დალაგებულია მაშინ ოპტიმალურია ყოველი მომდევნო წყვილი
