// მასივის ხარისხი - მისი უდიდესი სიხშირეა
// მასივში შეიძლება რამდენიმე ელემენტი იყოს წარმოდგენილი მსგავსი სიხშირეებით

// მასივის ხარისხის განმარტებიდან გამომდინარე ამოცანის მიზანია ისეთი ქვემიმდევრობის პოვნა რომლის საწყისი და საბოლოო წევრები ხარისხის განმსაზღვრელი ელემენტებია 

// თუ მასივის ხარისხი მხოლოდ ერთი ელემენტის სიხშირით განისაზღვრება მაშინ ამოცანის პასუხია ამ ელემენტის ბოლო და პირველი პოზიციების სხვაობაა
// თუ რამდენიმე ელემენტს აქვს ერთნაერი მაქსიმალური სიხშირე, ვპოულობთ ბოლო-პირველი პოზიციის სხვაობას თითოეულისთვის და ვაბრუნებთ უმცირესს

