// მასივის ხარისხი - მისი უდიდესი სიხშირეა
// მასივში შეიძლება რამდენიმე ელემენტი იყოს წარმოდგენილი მსგავსი სიხშირეებით

// მასივის ხარისხის განმარტებიდან გამომდინარე ამოცანის მიზანია ისეთი ქვემიმდევრობის პოვნა რომლის საწყისი და საბოლოო წევრები ხარისხის განმსაზღვრელი ელემენტებია 

// თუ მასივის ხარისხი მხოლოდ ერთი ელემენტის სიხშირით განისაზღვრება მაშინ ამოცანის პასუხია ამ ელემენტის ბოლო და პირველი პოზიციების სხვაობაა
// თუ რამდენიმე ელემენტს აქვს ერთნაერი მაქსიმალური სიხშირე, ვპოულობთ ბოლო-პირველი პოზიციის სხვაობას თითოეულისთვის და ვაბრუნებთ უმცირესს

// ალგორითმი:
// ნაბიჯი 1 - შევქმნათ ობიექტი frequencies = {} რომელშიც შევინახავთ ელემენტთა სიხშირეებს
// ნაბიჯი 2 - შევქმნათ ციკლი გადმოცემულ მასივის ელემენტების გამოსაძახებლად
// ნაბიჯი 3 - განვაახლოთ სიხშირეების მასივი მიმდინარე ელემენტის შესაბამისად
// ნაბიჯი 4 - მიღებული სიხშირეებიდან გამოვარჩიოთ უდიდესი მნიშვნელობის მქონე/მქონენი
// ნაბიჯი 5 - ვიპოვოთ უდიდესი სიხშირის მქონე ელემენტის/ელემენტების ბოლო და პირველ პოზიციებს შორის სხვაობა და დავაბრუნოთ მათ შორის უმცირესი