// ამოცანაში შეიძლება ითქვას რომ მოცემულია ალგორითმი, რომლის იმპლემენტირებაც უნდა მოვახდინოთ კოდში
// პროგრამულად ალგორითმის სახე იქნება შემდეგი:

// ალგორითმი:
// შევქმნათ ქულების შემნახველი მასივი board
// შევქმნათ ციკლი გადმოცემული მასივის ელემენტებზე იტერაციისთვის
// შევქმნათ switch გამოსახულება და დავაკვირდეთ აქტიურ ელემენტს
// თუ ელემენტი არის C, მაშინ წავშალოთ board დან ბოლო ჩანაწერი
// თუ ელემენტი არის D, მაშინ დავამატოთ ახალი ქულა, რომელიც გაორკეცებული წინა ქულა იქნება
// თუ ელემენტი არის +, მაშინ დავამატოთ ახალი ქულა, რომელიც წინა ორი ქულის ჯამი იქნება
// სხვა შემთხვევაში გვაქვს რიცხვი რომელიც შეგვყავს board ში როგორც ახალი წევრი
// დავაბრუნოთ board მასივის ანაჯამი როგორც ფუნქციის შედეგი