// დავალების მიზანია მოცემული მნიშვნელობების რიგითობის განსაზღვრა
// მათი ამჟამინდელი პოზიციის შენარჩუნება მნიშვნელოვანია

// O(n^2) გადაჭრა იქნება თუ თითოეული ელემენტისთვის შევამოწმებთ, თუ რამდენი ელემენტია მასზე მეტი
// რადგან თითოეული ელემენტი უნიკალურია, შეუძლებელია ორი განსხვავებული ელემენტისთვის მივიღოთ ერთნაერი მნიშვნელობა

// გადაჭრა პირდაპირია, და ვფიქრობ ვერ იქნება ოპტიმალური, რადგან მასივის ზომა 10 ის 4 ხარისხამდე მერყეობს
// შესაძლოა რომ მსგავსი გადაჭრით დროის ლიმიტშიც ვერ ჩავეტიოთ
// შედარებით ოპტიმალური იქნებოდა მნიშვნელობებს თუ დავალაგებთ დროებით მასივში
// ხოლო შემდეგ არსებულ მასივს გარდავქმნით რიგითობის მასივის შესაბამისად
// თუმცა პირველ ეტაპზე არ მინდა გარე რესურსების გამოყენება, და პირადად სამწუხაროდ ვერ ვიგონებ რომელიმე დალაგების ალგორითმს
