// ამოცანის მიზანია ვიპოვოთ საშუალო იმ მიმდევრობისა რომლის ჯამიც იქნება უდიდესი მოცემული მასივის შესაძლო მიმდევრობებს შორის.
// რადგან ქვემიმდევრობა უწყვეტი უნდა იყოს, პრობელმის ხასიათა ე.წ მოძრავი ფანჯარის პრიციპისაა
// ჩვენ უნდა მოვახდინოთ იტერაცია ისე რომ დავაფიქსიროთ ყველა შესაძლო ვარიანტი
// ფანჯრის ზომა იქნება გადმოცემული რიცხვის შესაბამისი
// შესაძლოა შევქმნათ ცვლადი რომელშიც ყოველ შესაძლო მნიშვნელობას შევინახავთ
// ან შევქმნათ ცვლად სადაც მხოლოდ უდიდეს მნიშვნელობას დავაფიქსირებთ

// ალგორითმი 
// ნაბიჯი 1 - შევქმნათ ცვლადი validSubArrSums = []
// ნაბიჯი 2 - გავმართოთ ციკლი მასივზე იტერაციისთვის მოძრავი ფანჯრის პრინციპით
// ნაბიჯი 3 - თითოეული ქვემიმდევრობის ჯამი შევინახოთ validSubArrSums ში
// ნაბიჯი 4 - დავაბრუნოთ უდიდესი ჯამის განაყოფი გადმოცემუ k არგუმენტზე