// მოცემულია ორი მასივი
// ჩვენი მიზანია ვიპოვოთ მოცემულ მასივთა თანაკვეთა
// რაც გულისხმობს ისეთი ახალი მასივის შექმნას
// რომელშიც შემავალი თითოეული ელემენტი წარმოდგენილი იქნება თავდაპირველად მოწოდებულ ორივე მასივში
// არა მხოლოდ მნიშვნელობა, არამედ ელემენტთა სიხშირეც უნდა იყოს შესაბამისი

// ამოცანის ამოსახსნელად შესაძლებელია გამოვიყენოთ "ჰაშრუკა"
// თითოეული მასივისთვის შევქმნათ ახალი "ჰაშრუკა"
// სადაც წარმოდგენილი იქნება ელემენტები და სიხშირეები
// შემდეგი ნაბიჯი იქნება "ჰაშრუკა" გამოვიყენოთ ახალი მასივის შესაქმნელად
// გავითვალისწინოთ ელემენტის არსებობა ორივე "ჰაშრუკაში" და მათი სიხშირე

// ალგორითმი:
// მოქმედება 1 - შევქმნათ ახალი ობიექტები hashNums1 და hashNums2
// მოქმედება 2 - შევქმნათ ცარიელი მასივი result
// მოქმედება 3 - შევქმნათ იტერაციული ციკლი პირველი მასივისთვის
// მოქმედება 4 - თითოეული იტერაციისთვის შევამოწმოთ არის თუ არა შესაბამის "ჰაშრუკაში" ამჟამინდელი ელემენტი
// მოქმედება 5 - თუ ელემენტი წარმოდგენილია, მაშინ გავზარდოთ მისი სიხშირე ერთით
// მოქმედება 6 - თუ ელემენტი წარმოდგენილი არ არის, მაშინ დავამატოთ იგი "ჰაშრუკაში" და მივანიჭოთ სიხშირე 1
// მოქმედება 7 - შევქმნათ იტერაციული ციკლი მეორე მასივისთვის
// მოქმედება 8 - გავიმეოროთ 4-6 მოქმედებები შესაბამისი მნიშვნელობებისთვის
// მოქმედება 9 - შევქმნათ იტერაციული ციკლი hashNums1 ობიექტის გასაღებებისთვის
// მოქმედება 10 - თითოეული გასაღებისთვის შევამოწმოთ არის თუ არა იგივე გასაღები  hashNums2 ობიექტში
// მოქმედება 11 - თუ ელემენტი წარმოდგენილია ორივე ობიექტში მაშინ დავამატოთ იგი result მასივში ელემენტების სიხშირეებს შორის უმცირესი მნიშვნელობის შესაბამისად
// მოქმედება 12 - თუ ელემენტი წარმოდგენი არ არის რომელიმე ობიექტში მაშინ გამოვტოვოთ იტერაცია
// მოქმედება 13 - დავაბრუნოთ result მასივი