// მარტივია თითოეული შეტევისთვის ხანგრძლივობის დათვლა
// შესაბამისად ჯამის პოვნაც მარტივია
// შედარებით დასაფიქრებელია თანაკვეთების
// ანუ იმ მომენტების დაფიქსირება როცა დროის ათვლა იწყება თავიდან
// ანუ ყოველი ახალი შეტევისას თუ არსებობს დაუსრულებელი წინა შეტევა
// ვწყვეტთ წინა შეტევას და ვიწყებთ ახალი შეტევის ათვლას

// თუ მასივის ელემენტებს შორის ინტერვალი ხანგრძლივობაზე ნაკლებია
// ეს ნიშნავს რომ თითოეული შეტევა დაწყებული პირველიდან ებმის მომდევნოს
// ამ შემთხვევაში შეგვიძლია ავიღო საწყისი დრო, პირველი შეტევა
// გამოვაკლოთ ის ბოლო შეტევის მაჩვენებელს
// და მიღებულ სხვაობას დავუმატოთ ხანგრძლივობა
// ასე უნდა ვიმოქმედოთ ყოველი შემდგომი შეტევების ჯაჭვისთვის