// ერთ სტრიქონში პერიმეტრის პოვნა რთული არ არის
// თუმცა როდესაც ორ სტრიქონს ვაერთებთ მათ აქვთ საერთო საზღვარი
// რომელიც ანულირდება?
// თუ ვიპოვით თითოეულ თანაკვეთას 
// და გვეცოდინება 1 ების რაოდენობა
// შეგვიძლია კუნძულის პერიმეტრის დათვლა

// 1 ების რაოდენობის დათვლა რთული არ არის
// თანაკვეთის საპოვნელად უნდა დავაფიქსიროთ თითოეული სტრიქონში 1 ების ინდექსი
// თუ მეზობელ სტრიქონში იგივე ინდექსზე გვაქვს 1 ესეიგი გვაქვს თანაკვეთა
// ყოველი თანაკვეთი აბათილებს 2 ერთეულს პარამეტრის ჯამიდან

// რატომღაც მგონია რომ ობიექტად წარმოდგენა მოცემული ცხრილის
// გაამარტივებს საქმეს