// ერთ სტრიქონში პერიმეტრის პოვნა რთული არ არის
// თუმცა როდესაც ორ სტრიქონს ვაერთებთ მათ აქვთ საერთო საზღვარი
// რომელიც ანულირდება?
// თუ ვიპოვით თითოეულ თანაკვეთას 
// და გვეცოდინება 1 ების რაოდენობა
// შეგვიძლია კუნძულის პერიმეტრის დათვლა

// 1 ების რაოდენობის დათვლა რთული არ არის
// თანაკვეთის საპოვნელად უნდა დავაფიქსიროთ თითოეული სტრიქონში 1 ების ინდექსი
// თუ მეზობელ სტრიქონში იგივე ინდექსზე გვაქვს 1 ესეიგი გვაქვს თანაკვეთა
// ყოველი თანაკვეთი აბათილებს 2 ერთეულს პარამეტრის ჯამიდან

// რატომღაც მგონია რომ ობიექტად წარმოდგენა მოცემული ცხრილის
// გაამარტივებს საქმეს
// თუმცა ჯერ ვცდი მოცემული მასივის გამოყენებით

// ალგორითმი:
// ნაბიჯი 1 - შევქმნათ ცვლადი კვადრატების რაოდენობის დასათვლელად ones
// ნაბიჯი 2 - შევქმნათ ცვლადი თანაკვეთების დასათვლელად commEdge
// ნაბიჯი 3 - შევქმნათ ციკლი სვეტებისთვის
// ნაბიჯი 4 - შევქმნათ ცვლადი სტრიქონებისთვის
// ნაბიჯი 5 - გამოვიძახოთ თითოეული ელემენტი
// ნაბიჯი 6 - თუ მისი მნიშვნელობა 1, მაშინ დავამატოთ ones
// ნაბიჯი 7 - თუ არსებობს წინა სტრიქონი, და მასში ამჟამინდელ ინდექსზე გვაქვს 1, მაშინ commEdge გავზარდოთ ერთით
// ნაბიჯი 8 - ones გავამრავლოთ 4-ზე და გამოვაკლოთ commEdge გამრავლებული 2-ზე